#include <iostream>
#include <math.h>
 using namespace std;

int main() {
    setlocale (LC_ALL, "uk_UA");
    cout<<"-------------------------Лабораторна робота №3----------------------------"<<endl;               //"-Лабораторна робота №3-" - рядкова константа
    cout<<"-------------------Робота з типами double та short------------------------"<<endl<<endl;

    cout<<"\n-----------------------------Завдання 1-----------------------------------"<<endl<<endl;
    double a=0;                                                                                                                                     //ініціалізація змінної а
    short b=0;
    cout<<"Введіть дійсне число: "<<endl;
    cin>>a;
    cout<<"Введіть ціле число: "<<endl;
    cin>>b;

    cout<<"\n-----------------------------Завдання 2-----------------------------------"<<endl;
    short shortRes=a/b+b;                                                                                                           //shortRes-ідентифікатор
    double doubleRes=a/b+b;
    cout<<"\nРезультат обчислень збережений у змінних\nрізного типу.";
    if (shortRes==doubleRes){
        cout<<"Результати співпадають"<<endl;
    }
    else{
        cout<<"Результати не співпадають"<<endl;
    }
    
    cout<<"\n-----------------------------Завдання 3-----------------------------------"<<endl;
    short newA=a;
    cout<<"\nНеявне перетворення типів (double в short)\n"<<endl;
    cout<<"\tЗначення до перетворення:  "<<a<<endl;
    cout<<"\tЗначення після перетворення:  "<<newA<<endl;
    
    cout<<"\n-----------------------------Завдання 4-----------------------------------"<<endl;
    double   newB=(double)b;
    cout<<"\nЯвне перетворення типів (short в double)\n"<<endl;
    cout<<"\tЗначення до перетворення:  "<<b<<endl;
    cout<<"\tЗначення після перетворення:  "<<newB<<endl;

    cout<<"\n-----------------------------Завдання 5-----------------------------------"<<endl;
    bool compare;
    cout<<"\nРезультат порівняння:"<<endl<<endl;
    compare=(a==b);
    cout<<"\t(a==b) Результат:  "<<compare<<endl;
    compare=(a!=b);
    cout<<"\t(a!=b) Результат:  "<<compare<<endl;

    cout<<"\n-----------------------------Завдання 6-----------------------------------"<<endl;
    cout<<"\nПри перетворенні типів double в short"<<endl;
    if (newA==a){
        cout<<"обрізання не відбулося"<<endl;
    }
    else{
        cout<<"обрізання відбулося"<<endl;
    }

    cout<<"\n-----------------------------Завдання 7-----------------------------------"<<endl;
    cout<<"Змінна a займає "<<sizeof(a)<<" байтів"<<endl;
    cout<<"Змінна b займає "<<sizeof(b)<<" байти"<<endl;

    cout<<"\n-----------------------------Завдання 8-----------------------------------"<<endl;
    cout<<"Адреса змінної a:    "<<&a<<endl;
    cout<<"Адреса змінної b:    "<<&b<<endl;
    cout << "Shortres до ділення = " << shortRes << endl;
    shortRes /= b;
    cout << "Shortres після ділення = " << shortRes << endl;
    if (a>b){
        cout << "a>b"<<endl;
    }
    else {
        cout<<"a<=b"<<endl;
    }

    return 0;
}